app/Models/proyectosPersonales/practicaConModelos/EstudianteModel.php

SELECT *
FROM `tbl_estudiante`
---
    public function mostrarEstudiantes()
    {
        return $this->findAll();