app/Controllers/proyectosPersonales/ajax/Empleado.php

    public function insertar()
    {
        $db = \Config\Database::connect('ajaxEjemplo');
        $model = new EmpleadoModel($db);

        $data = [
            'nombre'   => $this->request->getPost('nombre'),
            'apellido' => $this->request->getPost('apellido'),
            'telf'     => $this->request->getPost('telefono')
        ];

        $model->insert($data);
---
INSERT INTO `tbl_empleado` (`nombre`, `apellido`, `telf`) VALUES ('jose', 'cuervo', '123445667')