app/Controllers/proyectosPersonales/practicaConModelos/EmpleadoController.php

INSERT INTO `tbl_empleado` (`nombre`, `apellido`, `telf`) VALUES ('nathan', 'arboleda', '0998098630')
---
    public function insertar()
    // crear el insert
    // declarar la base de datos
    {
        $db = \config\database::connect("ajaxEjemplo");
        $model = new EmpleadoModel($db);

        $data = [
            'nombre' => $this->request->getpost('nombre'),
            'apellido' => $this->request->getpost('apellido'),
            'telf' => $this->request->getpost('telefono')
        ];

        $model->insert($data);