app/Controllers/proyectosPersonales/formularios/EmpleadoController.php

    public function index()
    {
       $model = new EmpleadoModel();
        $empleados = $model->findAll();
---
SELECT *
FROM `tbl_empleado`